goal_share/app/views/goals/feed.html.erb

SELECT "cheers".* FROM "cheers" WHERE (user_id == 4) AND (updated_at > '2013-12-19 22:50:04.378407')
---
  </p>
  <p>Number of cheers: <%=goal.cheers.length%>