goal_share/app/controllers/goals_controller.rb

  def completed
    if !params[:format].nil?
      @goal = Goal.find(params[:format])
---
SELECT "goals".* FROM "goals" WHERE "goals"."id" = ? LIMIT 1  [["id", "1"]]

  def feed
    @goals = Goal.where("private == ?", false)
---
SELECT "goals".* FROM "goals" WHERE (private == 'f')

  def cheers
    @goals = Goal.where("private == ?", false)
    if current_user.has_cheers?(current_user)
      @goal = Goal.find(params[:format])
      @cheer = current_user.cheers.new({:goal_id => @goal.id})
      if @cheer.save
---
SELECT "goals".* FROM "goals" WHERE (private == 'f')
SELECT "goals".* FROM "goals" WHERE "goals"."id" = ? LIMIT 1  [["id", "2"]]
INSERT INTO "cheers" ("created_at", "goal_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Fri, 20 Dec 2013 22:42:27 UTC +00:00], ["goal_id", 2], ["updated_at", Fri, 20 Dec 2013 22:42:27 UTC +00:00], ["user_id", 4]]

  def create
    @goal = Goal.new(params[:goal])
    @goal.user_id = current_user.id
    if @goal.save
---
INSERT INTO "goals" ("body", "completed", "created_at", "private", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)

  def destroy
    @goal = Goal.find(params[:id])
    flash[:notice] = ["#{@goal.body} deleted"]
    @goal.destroy
---
SELECT "goals".* FROM "goals" WHERE "goals"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "goals" WHERE "goals"."id" = ?  [["id", 1]]