goal_share/app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("created_at", "email", "password_digest", "session_token", "updated_at") VALUES (?, ?, ?, ?, ?)

  def destroy
    @user = User.find(params[:id])
    flash[:notice] = ["#{@user.email} deleted!"]
    @user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]